; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	image4 - mode
	image2 - mode
	infrared3 - mode
	thermograph0 - mode
	image1 - mode
	GroundStation0 - direction
	GroundStation7 - direction
	Star9 - direction
	Star8 - direction
	Star1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation10 - direction
	GroundStation3 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(supports instrument0 image4)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star6)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph0)
	(supports instrument1 image4)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation10)
	(calibration_target instrument1 Star8)
	(supports instrument2 thermograph0)
	(supports instrument2 image4)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument3 infrared3)
	(supports instrument3 image4)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 image4)
	(supports instrument4 image2)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation10)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 thermograph0)
	(supports instrument5 image4)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 GroundStation10)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument6 image1)
	(supports instrument6 image2)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 Star5)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet15)
)
(:goal (and
	(pointing satellite2 Planet15)
	(have_image Phenomenon11 image1)
	(have_image Star12 thermograph0)
	(have_image Star13 image2)
	(have_image Phenomenon14 image1)
	(have_image Planet15 thermograph0)
	(have_image Planet16 image4)
))

)

; plan
1. (turn_to satellite1 groundstation10 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 groundstation10)
   goals met: 1 of 7
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 7
3. (calibrate satellite1 instrument4 groundstation10)
   added: (calibrated instrument4)
   goals met: 1 of 7
4. (turn_to satellite1 planet16 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 planet16)
   goals met: 1 of 7
5. (take_image satellite1 planet16 instrument4 image4)
   added: (have_image planet16 image4)
   goals met: 2 of 7
6. (turn_to satellite1 planet15 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet15)
   goals met: 2 of 7
7. (take_image satellite1 planet15 instrument4 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 3 of 7
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 7
9. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 3 of 7
10. (turn_to satellite0 phenomenon11 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 7
11. (take_image satellite0 phenomenon11 instrument0 image1)
   added: (have_image phenomenon11 image1)
   goals met: 4 of 7
12. (turn_to satellite0 phenomenon14 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon14)
   goals met: 4 of 7
13. (take_image satellite0 phenomenon14 instrument0 image1)
   added: (have_image phenomenon14 image1)
   goals met: 5 of 7
14. (turn_to satellite0 star12 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star12)
   goals met: 5 of 7
15. (take_image satellite0 star12 instrument0 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 6 of 7
16. (turn_to satellite1 star13 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star13)
   goals met: 6 of 7
17. (take_image satellite1 star13 instrument4 image2)
   added: (have_image star13 image2)
   goals met: 7 of 7
